wegi1/STM32F407VET6-DISC1-FSMC-AND-TOUCH-SCREEN/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "ili9341.h"
#include "touch_panel.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */
extern uint32_t my_utoa(uint8_t * buf, uint32_t data);
extern uint32_t my_itoa(uint8_t * buf, uint32_t data);
extern void my_htoa32(uint8_t * buf, uint32_t data);
extern void my_htoa64(uint8_t * buf, uint64_t data);
extern uint8_t idx[];
/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LCDTP_IRQ_Pin GPIO_PIN_2
#define LCDTP_IRQ_GPIO_Port GPIOE
#define LCD_BL_Pin GPIO_PIN_0
#define LCD_BL_GPIO_Port GPIOB
#define LCDTP_CLK_Pin GPIO_PIN_1
#define LCDTP_CLK_GPIO_Port GPIOB
#define LCDTP_CS_Pin GPIO_PIN_2
#define LCDTP_CS_GPIO_Port GPIOB
#define LCDTP_DOUT_Pin GPIO_PIN_0
#define LCDTP_DOUT_GPIO_Port GPIOE
#define LCDTP_DIN_Pin GPIO_PIN_1
#define LCDTP_DIN_GPIO_Port GPIOE

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
